<!-- add-pr-comment:add-pr-comment -->

## Terraform github repositories plan
```
module.ministryofjustice-test.module.test_tamf_repo_test_org.github_repository.default: Preparing import... [id=test-tamf-repo-test-org]
module.ministryofjustice-test.module.test-repo-levg.github_repository.default: Preparing import... [id=test-repo-levg]
data.github_team.operations_engineering_test: Reading...
data.github_team.test_team_access: Reading...
module.ministryofjustice-test.module.test-repo-levg.github_repository.default: Refreshing state... [id=test-repo-levg]
module.ministryofjustice-test.module.test_tamf_repo_test_org.github_repository.default: Refreshing state... [id=test-tamf-repo-test-org]
module.ministryofjustice.module.operations-engineering-kpi-dashboard.github_repository.default: Preparing import... [id=operations-engineering-kpi-dashboard]
module.ministryofjustice.module.operations-engineering-certificate-renewal.github_repository.default: Preparing import... [id=operations-engineering-certificate-renewal]
module.ministryofjustice.module.operations-engineering-user-guide.github_repository.default: Preparing import... [id=operations-engineering-user-guide]
module.ministryofjustice.module.operations-engineering-runbooks.github_repository.default: Preparing import... [id=operations-engineering-runbooks]
data.github_team.operations_engineering: Reading...
module.ministryofjustice.module.operations-engineering-kpi-dashboard.github_repository.default: Refreshing state... [id=operations-engineering-kpi-dashboard]
module.ministryofjustice.module.operations-engineering-support-metadata.github_repository.default: Preparing import... [id=operations-engineering-support-metadata]
module.ministryofjustice.module.operations-engineering-support-metadata.github_repository.default: Refreshing state... [id=operations-engineering-support-metadata]
module.ministryofjustice.module.operations-engineering-user-guide.github_repository.default: Refreshing state... [id=operations-engineering-user-guide]
module.ministryofjustice.module.operations-engineering-certificate-renewal.github_repository.default: Refreshing state... [id=operations-engineering-certificate-renewal]
module.ministryofjustice.module.operations-engineering-runbooks.github_repository.default: Refreshing state... [id=operations-engineering-runbooks]
data.github_team.operations_engineering_test: Read complete after 1s [id=9456244]
module.ministryofjustice.module.github-actions.github_repository.default: Preparing import... [id=github-actions]
module.ministryofjustice.module.github-actions.github_repository.default: Refreshing state... [id=github-actions]
module.ministryofjustice.module.operations-engineering-documentation-browser-extension.github_repository.default: Preparing import... [id=operations-engineering-documentation-browser-extension]
module.ministryofjustice.module.operations-engineering-documentation-browser-extension.github_repository.default: Refreshing state... [id=operations-engineering-documentation-browser-extension]
module.ministryofjustice.module.terraform-github-repository.github_repository.default: Preparing import... [id=terraform-github-repository]
module.ministryofjustice.module.terraform-github-repository.github_repository.default: Refreshing state... [id=terraform-github-repository]
data.github_team.test_team_access: Read complete after 1s [id=9472191]
module.ministryofjustice.module.operations-engineering-cloud-platform-namespace.github_repository.default: Preparing import... [id=operations-engineering-cloud-platform-namespace]
module.ministryofjustice.module.operations-engineering-cloud-platform-namespace.github_repository.default: Refreshing state... [id=operations-engineering-cloud-platform-namespace]
module.ministryofjustice.module.operations-engineering-github-actions-dashboard.github_repository.default: Preparing import... [id=operations-engineering-github-actions-dashboard]
module.ministryofjustice.module.operations-engineering-github-actions-dashboard.github_repository.default: Refreshing state... [id=operations-engineering-github-actions-dashboard]
module.ministryofjustice.module.operations-engineering-find-a-github-repository-owner.github_repository.default: Preparing import... [id=operations-engineering-find-a-github-repository-owner]
module.ministryofjustice.module.operations-engineering-find-a-github-repository-owner.github_repository.default: Refreshing state... [id=operations-engineering-find-a-github-repository-owner]
module.ministryofjustice.module.terraform-aws-mtasts.github_repository.default: Preparing import... [id=terraform-aws-mtasts]
module.ministryofjustice.module.terraform-aws-mtasts.github_repository.default: Refreshing state... [id=terraform-aws-mtasts]
data.github_team.operations_engineering: Read complete after 4s [id=4192115]
module.ministryofjustice.module.operations-engineering.github_repository.default: Preparing import... [id=operations-engineering]
module.ministryofjustice.module.operations-engineering.github_repository.default: Refreshing state... [id=operations-engineering]
module.ministryofjustice.module.template-repository.github_repository.default: Preparing import... [id=template-repository]
module.ministryofjustice.module.template-repository.github_repository.default: Refreshing state... [id=template-repository]
module.ministryofjustice-test.module.test_tamf_repo_test_org.github_branch_protection.default: Preparing import... [id=test-tamf-repo-test-org]
module.ministryofjustice-test.module.test-repo-levg.github_branch_protection.default: Preparing import... [id=test-repo-levg]
module.ministryofjustice.module.operations-engineering-kpi-dashboard.github_branch_protection.default: Preparing import... [id=operations-engineering-kpi-dashboard]
module.ministryofjustice.module.operations-engineering-certificate-renewal.github_branch_protection.default: Preparing import... [id=operations-engineering-certificate-renewal]
module.ministryofjustice.module.operations-engineering-support-metadata.github_branch_protection.default: Preparing import... [id=operations-engineering-support-metadata]
module.ministryofjustice.module.operations-engineering-documentation-browser-extension.github_branch_protection.default: Preparing import... [id=operations-engineering-documentation-browser-extension]
module.ministryofjustice.module.operations-engineering-runbooks.github_branch_protection.default: Preparing import... [id=operations-engineering-runbooks]
module.ministryofjustice-test.module.test_tamf_repo_test_org.github_team_repository.maintain["9456244"]: Preparing import... [id=9456244:test-tamf-repo-test-org]
module.ministryofjustice-test.module.test_tamf_repo_test_org.github_team_repository.maintain["9456244"]: Refreshing state... [id=9456244:test-tamf-repo-test-org]
module.ministryofjustice.module.operations-engineering-kpi-dashboard.github_team_repository.admin["4192115"]: Preparing import... [id=4192115:operations-engineering-kpi-dashboard]
module.ministryofjustice.module.operations-engineering-kpi-dashboard.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-kpi-dashboard]
module.ministryofjustice-test.module.test_tamf_repo_test_org.github_team_repository.push["9472191"]: Preparing import... [id=9472191:test-tamf-repo-test-org]
module.ministryofjustice-test.module.test_tamf_repo_test_org.github_team_repository.push["9472191"]: Refreshing state... [id=9472191:test-tamf-repo-test-org]
module.ministryofjustice.module.operations-engineering-certificate-renewal.github_team_repository.admin["4192115"]: Preparing import... [id=4192115:operations-engineering-certificate-renewal]
module.ministryofjustice.module.operations-engineering-certificate-renewal.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-certificate-renewal]
module.ministryofjustice.module.operations-engineering-support-metadata.github_team_repository.admin["4192115"]: Preparing import... [id=4192115:operations-engineering-support-metadata]
module.ministryofjustice.module.operations-engineering-support-metadata.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-support-metadata]
module.ministryofjustice.module.operations-engineering-documentation-browser-extension.github_team_repository.admin["4192115"]: Preparing import... [id=4192115:operations-engineering-documentation-browser-extension]
module.ministryofjustice.module.operations-engineering-documentation-browser-extension.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-documentation-browser-extension]
module.ministryofjustice.module.operations-engineering-runbooks.github_team_repository.admin["4192115"]: Preparing import... [id=4192115:operations-engineering-runbooks]
module.ministryofjustice.module.operations-engineering-runbooks.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-runbooks]
module.ministryofjustice.module.terraform-github-repository.github_team_repository.admin["4192115"]: Preparing import... [id=4192115:terraform-github-repository]
module.ministryofjustice.module.terraform-github-repository.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:terraform-github-repository]
module.ministryofjustice.module.terraform-github-repository.github_branch_protection.default: Preparing import... [id=terraform-github-repository]
module.ministryofjustice.module.operations-engineering-cloud-platform-namespace.github_team_repository.admin["4192115"]: Preparing import... [id=4192115:operations-engineering-cloud-platform-namespace]
module.ministryofjustice.module.operations-engineering-cloud-platform-namespace.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-cloud-platform-namespace]
module.ministryofjustice.module.operations-engineering-cloud-platform-namespace.github_branch_protection.default: Preparing import... [id=operations-engineering-cloud-platform-namespace]
module.ministryofjustice.module.operations-engineering-user-guide.github_branch_protection.default: Preparing import... [id=operations-engineering-user-guide]
module.ministryofjustice.module.operations-engineering-user-guide.github_team_repository.admin["4192115"]: Preparing import... [id=4192115:operations-engineering-user-guide]
module.ministryofjustice.module.operations-engineering-user-guide.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-user-guide]
module.ministryofjustice.module.operations-engineering-github-actions-dashboard.github_team_repository.admin["4192115"]: Preparing import... [id=4192115:operations-engineering-github-actions-dashboard]
module.ministryofjustice.module.operations-engineering-github-actions-dashboard.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-github-actions-dashboard]
module.ministryofjustice.module.operations-engineering-github-actions-dashboard.github_branch_protection.default: Preparing import... [id=operations-engineering-github-actions-dashboard]
module.ministryofjustice.module.operations-engineering-find-a-github-repository-owner.github_team_repository.admin["4192115"]: Preparing import... [id=4192115:operations-engineering-find-a-github-repository-owner]
module.ministryofjustice.module.operations-engineering-find-a-github-repository-owner.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-find-a-github-repository-owner]
module.ministryofjustice.module.operations-engineering-find-a-github-repository-owner.github_branch_protection.default: Preparing import... [id=operations-engineering-find-a-github-repository-owner]
module.ministryofjustice.module.github-actions.github_branch_protection.default: Preparing import... [id=github-actions]
module.ministryofjustice.module.github-actions.github_team_repository.admin["4192115"]: Preparing import... [id=4192115:github-actions]
module.ministryofjustice.module.github-actions.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:github-actions]
module.ministryofjustice.module.terraform-aws-mtasts.github_branch_protection.default: Preparing import... [id=terraform-aws-mtasts]
module.ministryofjustice.module.terraform-aws-mtasts.github_team_repository.admin["4192115"]: Preparing import... [id=4192115:terraform-aws-mtasts]
module.ministryofjustice.module.terraform-aws-mtasts.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:terraform-aws-mtasts]
module.ministryofjustice.module.template-repository.github_branch_protection.default: Preparing import... [id=template-repository]
module.ministryofjustice.module.template-repository.github_team_repository.admin["4192115"]: Preparing import... [id=4192115:template-repository]
module.ministryofjustice.module.template-repository.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:template-repository]
module.ministryofjustice.module.operations-engineering.github_branch_protection.default: Preparing import... [id=operations-engineering]
module.ministryofjustice.module.operations-engineering.github_team_repository.admin["4192115"]: Preparing import... [id=4192115:operations-engineering]
module.ministryofjustice.module.operations-engineering.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # module.ministryofjustice.module.github-actions.data.github_actions_public_key.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = "github-actions"
    }

  # module.ministryofjustice.module.github-actions.github_repository.default will be updated in-place
  # (imported from "github-actions")
  ~ resource "github_repository" "default" {
        allow_auto_merge            = false
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
        allow_update_branch         = false
      + archive_on_destroy          = true
        archived                    = false
        auto_init                   = false
        default_branch              = "main"
        delete_branch_on_merge      = true
        description                 = "A collection of reusable GitHub Actions for the Ministry of Justice, designed to streamline and enhance workflows across our projects. • This repository is defined and managed in Terraform"
        etag                        = "W/\"5afb7f0f7f05dba311cce1f080f39f90f6d6a075ad585bf8154f1c58dc99faf9\""
        full_name                   = "ministryofjustice/github-actions"
        git_clone_url               = "git://github.com/ministryofjustice/github-actions.git"
        has_discussions             = false
        has_downloads               = true
        has_issues                  = true
        has_projects                = true
        has_wiki                    = true
        html_url                    = "https://github.com/ministryofjustice/github-actions"
        http_clone_url              = "https://github.com/ministryofjustice/github-actions.git"
        id                          = "github-actions"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "github-actions"
        node_id                     = "MDEwOlJlcG9zaXRvcnkyMTUwNDI2MTg="
        primary_language            = "Python"
        private                     = false
        repo_id                     = 215042618
        squash_merge_commit_message = "COMMIT_MESSAGES"
        squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        ssh_clone_url               = "git@github.com:ministryofjustice/github-actions.git"
        svn_url                     = "https://github.com/ministryofjustice/github-actions"
        topics                      = [
            "operations-engineering",
        ]
        visibility                  = "public"
        vulnerability_alerts        = true
        web_commit_signoff_required = false

        pages {
            build_type = "legacy"
            custom_404 = false
            html_url   = "https://ministryofjustice.github.io/github-actions/"
            status     = "built"
            url        = "https://api.github.com/repos/ministryofjustice/github-actions/pages"

            source {
                branch = "main"
                path   = "/"
            }
        }

        security_and_analysis {
            secret_scanning {
                status = "enabled"
            }
            secret_scanning_push_protection {
                status = "enabled"
            }
        }
    }

  # module.ministryofjustice.module.github-actions.github_team_repository.admin["4192115"] will be imported
    resource "github_team_repository" "admin" {
        etag       = "W/\"e3e77e7463a777ec9aa2700f03d68221e5a5d61a40ee0532c742f9bb6f8ea228\""
        id         = "4192115:github-actions"
        permission = "admin"
        repository = "github-actions"
        team_id    = "4192115"
    }

  # module.ministryofjustice.module.operations-engineering.data.github_actions_public_key.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = "operations-engineering"
    }

  # module.ministryofjustice.module.operations-engineering.github_repository.default will be updated in-place
  # (imported from "operations-engineering")
  ~ resource "github_repository" "default" {
        allow_auto_merge            = false
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
        allow_update_branch         = false
      + archive_on_destroy          = true
        archived                    = false
        auto_init                   = false
        default_branch              = "main"
        delete_branch_on_merge      = true
        description                 = "This repository is home to the Operations Engineering's tools and utilities for managing, monitoring, and optimising software development processes at the Ministry of Justice. • This repository is defined and managed in Terraform"
        etag                        = "W/\"03793a940d8c033ac68d25ef2c498d9e7739050b7039f0ecf49fb560f1b77468\""
        full_name                   = "ministryofjustice/operations-engineering"
        git_clone_url               = "git://github.com/ministryofjustice/operations-engineering.git"
        has_discussions             = true
        has_downloads               = true
        has_issues                  = true
        has_projects                = true
        has_wiki                    = true
        homepage_url                = "https://user-guide.operations-engineering.service.justice.gov.uk/"
        html_url                    = "https://github.com/ministryofjustice/operations-engineering"
        http_clone_url              = "https://github.com/ministryofjustice/operations-engineering.git"
        id                          = "operations-engineering"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "operations-engineering"
        node_id                     = "MDEwOlJlcG9zaXRvcnkyMjMzODUwNDE="
        primary_language            = "Python"
        private                     = false
        repo_id                     = 223385041
        squash_merge_commit_message = "COMMIT_MESSAGES"
        squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        ssh_clone_url               = "git@github.com:ministryofjustice/operations-engineering.git"
        svn_url                     = "https://github.com/ministryofjustice/operations-engineering"
        topics                      = [
            "issue-tracker",
            "operations-engineering",
            "python",
        ]
        visibility                  = "public"
        vulnerability_alerts        = true
        web_commit_signoff_required = false

        pages {
            build_type = "workflow"
            custom_404 = false
            html_url   = "https://ministryofjustice.github.io/operations-engineering/"
            status     = "built"
            url        = "https://api.github.com/repos/ministryofjustice/operations-engineering/pages"

            source {
                branch = "main"
                path   = "/"
            }
        }

        security_and_analysis {
            secret_scanning {
                status = "enabled"
            }
            secret_scanning_push_protection {
                status = "enabled"
            }
        }
    }

  # module.ministryofjustice.module.operations-engineering.github_team_repository.admin["4192115"] will be imported
    resource "github_team_repository" "admin" {
        etag       = "W/\"1a3e3962b5c61c871c260da47f612ccc02700ee12a141beaa21dd02604020f89\""
        id         = "4192115:operations-engineering"
        permission = "admin"
        repository = "operations-engineering"
        team_id    = "4192115"
    }

  # module.ministryofjustice.module.operations-engineering-certificate-renewal.data.github_actions_public_key.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = "operations-engineering-certificate-renewal"
    }

  # module.ministryofjustice.module.operations-engineering-certificate-renewal.github_repository.default will be updated in-place
  # (imported from "operations-engineering-certificate-renewal")
  ~ resource "github_repository" "default" {
        allow_auto_merge            = false
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
        allow_update_branch         = false
      + archive_on_destroy          = true
        archived                    = false
        auto_init                   = false
        default_branch              = "main"
        delete_branch_on_merge      = true
        description                 = "An application to automatically manage the renewal of certificates, and notify when certificates are close to expiring. • This repository is defined and managed in Terraform"
        etag                        = "W/\"44cd43ebeca21c606ec58b9fada3ec15805da52b456b5f2fc19fa6b4dc579857\""
        full_name                   = "ministryofjustice/operations-engineering-certificate-renewal"
        git_clone_url               = "git://github.com/ministryofjustice/operations-engineering-certificate-renewal.git"
        has_discussions             = false
        has_downloads               = true
        has_issues                  = true
        has_projects                = true
        has_wiki                    = true
        html_url                    = "https://github.com/ministryofjustice/operations-engineering-certificate-renewal"
        http_clone_url              = "https://github.com/ministryofjustice/operations-engineering-certificate-renewal.git"
        id                          = "operations-engineering-certificate-renewal"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "operations-engineering-certificate-renewal"
        node_id                     = "R_kgDOI-HjhQ"
        primary_language            = "Python"
        private                     = false
        repo_id                     = 602006405
        squash_merge_commit_message = "COMMIT_MESSAGES"
        squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        ssh_clone_url               = "git@github.com:ministryofjustice/operations-engineering-certificate-renewal.git"
        svn_url                     = "https://github.com/ministryofjustice/operations-engineering-certificate-renewal"
        topics                      = [
            "operations-engineering",
        ]
        visibility                  = "public"
        vulnerability_alerts        = true
        web_commit_signoff_required = false

        security_and_analysis {
            secret_scanning {
                status = "enabled"
            }
            secret_scanning_push_protection {
                status = "enabled"
            }
        }

        template {
            include_all_branches = false
            owner                = "ministryofjustice"
            repository           = "template-repository"
        }
    }

  # module.ministryofjustice.module.operations-engineering-certificate-renewal.github_team_repository.admin["4192115"] will be imported
    resource "github_team_repository" "admin" {
        etag       = "W/\"52ff1bfa04d2b0a5047e8e8c666a4dee65bbd14939f77ad61bd95e617b54d5b2\""
        id         = "4192115:operations-engineering-certificate-renewal"
        permission = "admin"
        repository = "operations-engineering-certificate-renewal"
        team_id    = "4192115"
    }

  # module.ministryofjustice.module.operations-engineering-cloud-platform-namespace.data.github_actions_public_key.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = "operations-engineering-cloud-platform-namespace"
    }

  # module.ministryofjustice.module.operations-engineering-cloud-platform-namespace.github_repository.default will be updated in-place
  # (imported from "operations-engineering-cloud-platform-namespace")
  ~ resource "github_repository" "default" {
        allow_auto_merge            = false
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
        allow_update_branch         = false
      + archive_on_destroy          = true
        archived                    = false
        auto_init                   = false
        default_branch              = "main"
        delete_branch_on_merge      = true
        description                 = "This repository contains the terraform code for an operations engineering namespace in the cloud platform • This repository is defined and managed in Terraform"
        etag                        = "W/\"6a7a0c08713c17ee33757e6ef4789b32c237bc3f2d611175e7995e6f675e2f04\""
        full_name                   = "ministryofjustice/operations-engineering-cloud-platform-namespace"
        git_clone_url               = "git://github.com/ministryofjustice/operations-engineering-cloud-platform-namespace.git"
        has_discussions             = false
        has_downloads               = true
        has_issues                  = true
        has_projects                = true
        has_wiki                    = true
        html_url                    = "https://github.com/ministryofjustice/operations-engineering-cloud-platform-namespace"
        http_clone_url              = "https://github.com/ministryofjustice/operations-engineering-cloud-platform-namespace.git"
        id                          = "operations-engineering-cloud-platform-namespace"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "operations-engineering-cloud-platform-namespace"
        node_id                     = "R_kgDOMwMInw"
        primary_language            = "HCL"
        private                     = false
        repo_id                     = 855836831
        squash_merge_commit_message = "COMMIT_MESSAGES"
        squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        ssh_clone_url               = "git@github.com:ministryofjustice/operations-engineering-cloud-platform-namespace.git"
        svn_url                     = "https://github.com/ministryofjustice/operations-engineering-cloud-platform-namespace"
        topics                      = [
            "operations-engineering",
        ]
        visibility                  = "public"
        vulnerability_alerts        = true
        web_commit_signoff_required = false

        security_and_analysis {
            secret_scanning {
                status = "enabled"
            }
            secret_scanning_push_protection {
                status = "enabled"
            }
        }

        template {
            include_all_branches = false
            owner                = "ministryofjustice"
            repository           = "template-repository"
        }
    }

  # module.ministryofjustice.module.operations-engineering-cloud-platform-namespace.github_team_repository.admin["4192115"] will be imported
    resource "github_team_repository" "admin" {
        etag       = "W/\"5b6bbfadfd5f82c53556d3b009af592f89259c189132f588ac327a5b6e43e0d5\""
        id         = "4192115:operations-engineering-cloud-platform-namespace"
        permission = "admin"
        repository = "operations-engineering-cloud-platform-namespace"
        team_id    = "4192115"
    }

  # module.ministryofjustice.module.operations-engineering-documentation-browser-extension.data.github_actions_public_key.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = "operations-engineering-documentation-browser-extension"
    }

  # module.ministryofjustice.module.operations-engineering-documentation-browser-extension.github_repository.default will be updated in-place
  # (imported from "operations-engineering-documentation-browser-extension")
  ~ resource "github_repository" "default" {
        allow_auto_merge            = false
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
        allow_update_branch         = false
      + archive_on_destroy          = true
        archived                    = false
        auto_init                   = false
        default_branch              = "main"
        delete_branch_on_merge      = true
        description                 = "A browser extension to easily find documentation for building MoJ Digital Services • This repository is defined and managed in Terraform"
        etag                        = "W/\"e3737f22b12a2fdb4ea62d7bf58fb93336db1186798677f9db5b70b24145f10c\""
        full_name                   = "ministryofjustice/operations-engineering-documentation-browser-extension"
        git_clone_url               = "git://github.com/ministryofjustice/operations-engineering-documentation-browser-extension.git"
        has_discussions             = false
        has_downloads               = true
        has_issues                  = true
        has_projects                = true
        has_wiki                    = true
        html_url                    = "https://github.com/ministryofjustice/operations-engineering-documentation-browser-extension"
        http_clone_url              = "https://github.com/ministryofjustice/operations-engineering-documentation-browser-extension.git"
        id                          = "operations-engineering-documentation-browser-extension"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "operations-engineering-documentation-browser-extension"
        node_id                     = "R_kgDOK636CA"
        primary_language            = "HTML"
        private                     = false
        repo_id                     = 732822024
        squash_merge_commit_message = "COMMIT_MESSAGES"
        squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        ssh_clone_url               = "git@github.com:ministryofjustice/operations-engineering-documentation-browser-extension.git"
        svn_url                     = "https://github.com/ministryofjustice/operations-engineering-documentation-browser-extension"
        topics                      = [
            "operations-engineering",
        ]
        visibility                  = "public"
        vulnerability_alerts        = true
        web_commit_signoff_required = false

        security_and_analysis {
            secret_scanning {
                status = "enabled"
            }
            secret_scanning_push_protection {
                status = "enabled"
            }
        }

        template {
            include_all_branches = false
            owner                = "ministryofjustice"
            repository           = "template-repository"
        }
    }

  # module.ministryofjustice.module.operations-engineering-documentation-browser-extension.github_team_repository.admin["4192115"] will be imported
    resource "github_team_repository" "admin" {
        etag       = "W/\"589650250b15da9dafe0fc1a34d8069ea207a9c7761667ed0e2dcb8ba8d1b934\""
        id         = "4192115:operations-engineering-documentation-browser-extension"
        permission = "admin"
        repository = "operations-engineering-documentation-browser-extension"
        team_id    = "4192115"
    }

  # module.ministryofjustice.module.operations-engineering-find-a-github-repository-owner.data.github_actions_public_key.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = "operations-engineering-find-a-github-repository-owner"
    }

  # module.ministryofjustice.module.operations-engineering-find-a-github-repository-owner.github_repository.default will be updated in-place
  # (imported from "operations-engineering-find-a-github-repository-owner")
  ~ resource "github_repository" "default" {
        allow_auto_merge            = false
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
        allow_update_branch         = false
      + archive_on_destroy          = true
        archived                    = false
        auto_init                   = false
        default_branch              = "main"
        delete_branch_on_merge      = true
        description                 = "Find Owners of GitHub Reposistories • This repository is defined and managed in Terraform"
        etag                        = "W/\"82de1f60e5d7542e69158c2790f4dfed751597c6fa3141fcfb38fd767e135794\""
        full_name                   = "ministryofjustice/operations-engineering-find-a-github-repository-owner"
        git_clone_url               = "git://github.com/ministryofjustice/operations-engineering-find-a-github-repository-owner.git"
        has_discussions             = false
        has_downloads               = true
        has_issues                  = true
        has_projects                = true
        has_wiki                    = true
        html_url                    = "https://github.com/ministryofjustice/operations-engineering-find-a-github-repository-owner"
        http_clone_url              = "https://github.com/ministryofjustice/operations-engineering-find-a-github-repository-owner.git"
        id                          = "operations-engineering-find-a-github-repository-owner"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "operations-engineering-find-a-github-repository-owner"
        node_id                     = "R_kgDOManiYw"
        primary_language            = "Python"
        private                     = false
        repo_id                     = 833217123
        squash_merge_commit_message = "COMMIT_MESSAGES"
        squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        ssh_clone_url               = "git@github.com:ministryofjustice/operations-engineering-find-a-github-repository-owner.git"
        svn_url                     = "https://github.com/ministryofjustice/operations-engineering-find-a-github-repository-owner"
        topics                      = [
            "operations-engineering",
        ]
        visibility                  = "public"
        vulnerability_alerts        = true
        web_commit_signoff_required = false

        security_and_analysis {
            secret_scanning {
                status = "enabled"
            }
            secret_scanning_push_protection {
                status = "enabled"
            }
        }

        template {
            include_all_branches = false
            owner                = "ministryofjustice"
            repository           = "template-repository"
        }
    }

  # module.ministryofjustice.module.operations-engineering-find-a-github-repository-owner.github_team_repository.admin["4192115"] will be imported
    resource "github_team_repository" "admin" {
        etag       = "W/\"ca0c52ef97dbc8ac6ec8da322adf7af52bc10fa053685fd15bd15e2a0aec50f3\""
        id         = "4192115:operations-engineering-find-a-github-repository-owner"
        permission = "admin"
        repository = "operations-engineering-find-a-github-repository-owner"
        team_id    = "4192115"
    }

  # module.ministryofjustice.module.operations-engineering-github-actions-dashboard.data.github_actions_public_key.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = "operations-engineering-github-actions-dashboard"
    }

  # module.ministryofjustice.module.operations-engineering-github-actions-dashboard.github_repository.default will be updated in-place
  # (imported from "operations-engineering-github-actions-dashboard")
  ~ resource "github_repository" "default" {
        allow_auto_merge            = false
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
        allow_update_branch         = false
      + archive_on_destroy          = true
        archived                    = false
        auto_init                   = false
        default_branch              = "main"
        delete_branch_on_merge      = true
        description                 = "A GitHub repository for the Operations Engineering GitHub Actions dashboard • This repository is defined and managed in Terraform"
        etag                        = "W/\"db93bedb1fd0cd08e8c29591aaaa7ac5baddb52114e2717560929962a3a0a5d1\""
        full_name                   = "ministryofjustice/operations-engineering-github-actions-dashboard"
        git_clone_url               = "git://github.com/ministryofjustice/operations-engineering-github-actions-dashboard.git"
        has_discussions             = false
        has_downloads               = true
        has_issues                  = true
        has_projects                = true
        has_wiki                    = true
        html_url                    = "https://github.com/ministryofjustice/operations-engineering-github-actions-dashboard"
        http_clone_url              = "https://github.com/ministryofjustice/operations-engineering-github-actions-dashboard.git"
        id                          = "operations-engineering-github-actions-dashboard"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "operations-engineering-github-actions-dashboard"
        node_id                     = "R_kgDOMRCOOA"
        private                     = false
        repo_id                     = 823168568
        squash_merge_commit_message = "COMMIT_MESSAGES"
        squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        ssh_clone_url               = "git@github.com:ministryofjustice/operations-engineering-github-actions-dashboard.git"
        svn_url                     = "https://github.com/ministryofjustice/operations-engineering-github-actions-dashboard"
        topics                      = [
            "operations-engineering",
            "poc",
        ]
        visibility                  = "public"
        vulnerability_alerts        = true
        web_commit_signoff_required = false

        security_and_analysis {
            secret_scanning {
                status = "enabled"
            }
            secret_scanning_push_protection {
                status = "enabled"
            }
        }

        template {
            include_all_branches = false
            owner                = "ministryofjustice"
            repository           = "template-repository"
        }
    }

  # module.ministryofjustice.module.operations-engineering-github-actions-dashboard.github_team_repository.admin["4192115"] will be imported
    resource "github_team_repository" "admin" {
        etag       = "W/\"c9484ddac28f0fccd3397958da491536f9226af975eab4e4b34002f5d9605b08\""
        id         = "4192115:operations-engineering-github-actions-dashboard"
        permission = "admin"
        repository = "operations-engineering-github-actions-dashboard"
        team_id    = "4192115"
    }

  # module.ministryofjustice.module.operations-engineering-kpi-dashboard.data.github_actions_public_key.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = "operations-engineering-kpi-dashboard"
    }

  # module.ministryofjustice.module.operations-engineering-kpi-dashboard.github_repository.default will be updated in-place
  # (imported from "operations-engineering-kpi-dashboard")
  ~ resource "github_repository" "default" {
        allow_auto_merge            = false
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
        allow_update_branch         = false
      + archive_on_destroy          = true
        archived                    = false
        auto_init                   = false
        default_branch              = "main"
        delete_branch_on_merge      = true
        description                 = "Display KPI metrics of processes and services • This repository is defined and managed in Terraform"
        etag                        = "W/\"ef5f1e7dee3bd840167893e99c18127dc3b6d8bb83c2cf53e94d26f3707cada9\""
        full_name                   = "ministryofjustice/operations-engineering-kpi-dashboard"
        git_clone_url               = "git://github.com/ministryofjustice/operations-engineering-kpi-dashboard.git"
        has_discussions             = false
        has_downloads               = true
        has_issues                  = true
        has_projects                = true
        has_wiki                    = true
        homepage_url                = "https://kpi-dashboard.cloud-platform.service.justice.gov.uk/dashboard"
        html_url                    = "https://github.com/ministryofjustice/operations-engineering-kpi-dashboard"
        http_clone_url              = "https://github.com/ministryofjustice/operations-engineering-kpi-dashboard.git"
        id                          = "operations-engineering-kpi-dashboard"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "operations-engineering-kpi-dashboard"
        node_id                     = "R_kgDOL1tpxg"
        primary_language            = "Python"
        private                     = false
        repo_id                     = 794520006
        squash_merge_commit_message = "COMMIT_MESSAGES"
        squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        ssh_clone_url               = "git@github.com:ministryofjustice/operations-engineering-kpi-dashboard.git"
        svn_url                     = "https://github.com/ministryofjustice/operations-engineering-kpi-dashboard"
        topics                      = [
            "operations-engineering",
        ]
        visibility                  = "public"
        vulnerability_alerts        = true
        web_commit_signoff_required = false

        security_and_analysis {
            secret_scanning {
                status = "enabled"
            }
            secret_scanning_push_protection {
                status = "enabled"
            }
        }

        template {
            include_all_branches = false
            owner                = "ministryofjustice"
            repository           = "template-repository"
        }
    }

  # module.ministryofjustice.module.operations-engineering-kpi-dashboard.github_team_repository.admin["4192115"] will be imported
    resource "github_team_repository" "admin" {
        etag       = "W/\"9f9fdd2cf6d8c52a0f392e15211ad8263e0a0a6c0ffe884a4aa7ab5ec31be3b5\""
        id         = "4192115:operations-engineering-kpi-dashboard"
        permission = "admin"
        repository = "operations-engineering-kpi-dashboard"
        team_id    = "4192115"
    }

  # module.ministryofjustice.module.operations-engineering-runbooks.data.github_actions_public_key.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = "operations-engineering-runbooks"
    }

  # module.ministryofjustice.module.operations-engineering-runbooks.github_repository.default will be updated in-place
  # (imported from "operations-engineering-runbooks")
  ~ resource "github_repository" "default" {
        allow_auto_merge            = false
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
        allow_update_branch         = false
      + archive_on_destroy          = true
        archived                    = false
        auto_init                   = false
        default_branch              = "main"
        delete_branch_on_merge      = true
        description                 = "Runbook documentation for Operations Engineering • This repository is defined and managed in Terraform"
        etag                        = "W/\"d4d55ba82b7231811318c619f3ad7189ea9fdc09fa9f0b67b31b3dc381fae154\""
        full_name                   = "ministryofjustice/operations-engineering-runbooks"
        git_clone_url               = "git://github.com/ministryofjustice/operations-engineering-runbooks.git"
        has_discussions             = false
        has_downloads               = true
        has_issues                  = true
        has_projects                = true
        has_wiki                    = true
        homepage_url                = "https://runbooks.operations-engineering.service.justice.gov.uk/"
        html_url                    = "https://github.com/ministryofjustice/operations-engineering-runbooks"
        http_clone_url              = "https://github.com/ministryofjustice/operations-engineering-runbooks.git"
        id                          = "operations-engineering-runbooks"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "operations-engineering-runbooks"
        node_id                     = "R_kgDOKK8OCQ"
        primary_language            = "HTML"
        private                     = false
        repo_id                     = 682561033
        squash_merge_commit_message = "COMMIT_MESSAGES"
        squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        ssh_clone_url               = "git@github.com:ministryofjustice/operations-engineering-runbooks.git"
        svn_url                     = "https://github.com/ministryofjustice/operations-engineering-runbooks"
        topics                      = [
            "documentation",
            "operations-engineering",
        ]
        visibility                  = "public"
        vulnerability_alerts        = true
        web_commit_signoff_required = false

        pages {
            build_type = "workflow"
            cname      = "runbooks.operations-engineering.service.justice.gov.uk"
            custom_404 = false
            html_url   = "https://runbooks.operations-engineering.service.justice.gov.uk/"
            url        = "https://api.github.com/repos/ministryofjustice/operations-engineering-runbooks/pages"

            source {
                branch = "main"
                path   = "/"
            }
        }

        security_and_analysis {
            secret_scanning {
                status = "enabled"
            }
            secret_scanning_push_protection {
                status = "enabled"
            }
        }

        template {
            include_all_branches = false
            owner                = "ministryofjustice"
            repository           = "template-repository"
        }
    }

  # module.ministryofjustice.module.operations-engineering-runbooks.github_team_repository.admin["4192115"] will be imported
    resource "github_team_repository" "admin" {
        etag       = "W/\"f4c6e3affe4ef4e1b8e0b5b6a1d4c3c1cc79101bdfc4fef60f955405997db93a\""
        id         = "4192115:operations-engineering-runbooks"
        permission = "admin"
        repository = "operations-engineering-runbooks"
        team_id    = "4192115"
    }

  # module.ministryofjustice.module.operations-engineering-support-metadata.data.github_actions_public_key.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = "operations-engineering-support-metadata"
    }

  # module.ministryofjustice.module.operations-engineering-support-metadata.github_repository.default will be updated in-place
  # (imported from "operations-engineering-support-metadata")
  ~ resource "github_repository" "default" {
        allow_auto_merge            = false
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
        allow_update_branch         = false
      + archive_on_destroy          = true
        archived                    = false
        auto_init                   = false
        default_branch              = "main"
        delete_branch_on_merge      = true
        description                 = "This repository contains the data and tools for reporting Oerations Engineering support requests. • This repository is defined and managed in Terraform"
        etag                        = "W/\"5c9021c84c2153c43bb6ee6fe69095e0de2a050a4ece637bcc35aeda1c07cc2f\""
        full_name                   = "ministryofjustice/operations-engineering-support-metadata"
        git_clone_url               = "git://github.com/ministryofjustice/operations-engineering-support-metadata.git"
        has_discussions             = true
        has_downloads               = true
        has_issues                  = true
        has_projects                = true
        has_wiki                    = true
        homepage_url                = "https://operations-engineering-upport-metadata.operations-engineering.service.justice.gov.uk/"
        html_url                    = "https://github.com/ministryofjustice/operations-engineering-support-metadata"
        http_clone_url              = "https://github.com/ministryofjustice/operations-engineering-support-metadata.git"
        id                          = "operations-engineering-support-metadata"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "operations-engineering-support-metadata"
        node_id                     = "R_kgDOLWBtdg"
        primary_language            = "Python"
        private                     = false
        repo_id                     = 761294198
        squash_merge_commit_message = "COMMIT_MESSAGES"
        squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        ssh_clone_url               = "git@github.com:ministryofjustice/operations-engineering-support-metadata.git"
        svn_url                     = "https://github.com/ministryofjustice/operations-engineering-support-metadata"
        topics                      = [
            "operations-engineering",
        ]
        visibility                  = "public"
        vulnerability_alerts        = true
        web_commit_signoff_required = false

        security_and_analysis {
            secret_scanning {
                status = "enabled"
            }
            secret_scanning_push_protection {
                status = "enabled"
            }
        }

        template {
            include_all_branches = false
            owner                = "ministryofjustice"
            repository           = "template-repository"
        }
    }

  # module.ministryofjustice.module.operations-engineering-support-metadata.github_team_repository.admin["4192115"] will be imported
    resource "github_team_repository" "admin" {
        etag       = "W/\"6875a15ff1ecd38703fee4894f5fe17b50d2f130f16ccff03e469e313e7bcb34\""
        id         = "4192115:operations-engineering-support-metadata"
        permission = "admin"
        repository = "operations-engineering-support-metadata"
        team_id    = "4192115"
    }

  # module.ministryofjustice.module.operations-engineering-user-guide.data.github_actions_public_key.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = "operations-engineering-user-guide"
    }

  # module.ministryofjustice.module.operations-engineering-user-guide.github_repository.default will be updated in-place
  # (imported from "operations-engineering-user-guide")
  ~ resource "github_repository" "default" {
        allow_auto_merge            = false
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
        allow_update_branch         = false
      + archive_on_destroy          = true
        archived                    = false
        auto_init                   = false
        default_branch              = "main"
        delete_branch_on_merge      = true
        description                 = "User documentation for Operations Engineering • This repository is defined and managed in Terraform"
        etag                        = "W/\"d6c3e36d94caf59f885292a8315f1c4fa33fa6a92d5f56b94bd379f5c676142d\""
        full_name                   = "ministryofjustice/operations-engineering-user-guide"
        git_clone_url               = "git://github.com/ministryofjustice/operations-engineering-user-guide.git"
        has_discussions             = false
        has_downloads               = true
        has_issues                  = true
        has_projects                = true
        has_wiki                    = true
        homepage_url                = "https://user-guide.operations-engineering.service.justice.gov.uk/"
        html_url                    = "https://github.com/ministryofjustice/operations-engineering-user-guide"
        http_clone_url              = "https://github.com/ministryofjustice/operations-engineering-user-guide.git"
        id                          = "operations-engineering-user-guide"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "operations-engineering-user-guide"
        node_id                     = "R_kgDOKCGhmw"
        primary_language            = "HTML"
        private                     = false
        repo_id                     = 673292699
        squash_merge_commit_message = "COMMIT_MESSAGES"
        squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        ssh_clone_url               = "git@github.com:ministryofjustice/operations-engineering-user-guide.git"
        svn_url                     = "https://github.com/ministryofjustice/operations-engineering-user-guide"
        topics                      = [
            "documentation",
            "operations-engineering",
            "user-guides",
        ]
        visibility                  = "public"
        vulnerability_alerts        = true
        web_commit_signoff_required = false

        pages {
            build_type = "workflow"
            cname      = "user-guide.operations-engineering.service.justice.gov.uk"
            custom_404 = false
            html_url   = "https://user-guide.operations-engineering.service.justice.gov.uk/"
            url        = "https://api.github.com/repos/ministryofjustice/operations-engineering-user-guide/pages"

            source {
                branch = "main"
                path   = "/"
            }
        }

        security_and_analysis {
            secret_scanning {
                status = "enabled"
            }
            secret_scanning_push_protection {
                status = "enabled"
            }
        }

        template {
            include_all_branches = false
            owner                = "ministryofjustice"
            repository           = "template-documentation-site"
        }
    }

  # module.ministryofjustice.module.operations-engineering-user-guide.github_team_repository.admin["4192115"] will be imported
    resource "github_team_repository" "admin" {
        etag       = "W/\"86ea1e69361fb91ddb8a926a6c4983d91f1fe6ed12d8cae050a37ed0570041ee\""
        id         = "4192115:operations-engineering-user-guide"
        permission = "admin"
        repository = "operations-engineering-user-guide"
        team_id    = "4192115"
    }

  # module.ministryofjustice.module.template-repository.data.github_actions_public_key.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = "template-repository"
    }

  # module.ministryofjustice.module.template-repository.github_repository.default will be updated in-place
  # (imported from "template-repository")
  ~ resource "github_repository" "default" {
      ~ allow_auto_merge            = true -> false
      ~ allow_merge_commit          = false -> true
        allow_rebase_merge          = true
        allow_squash_merge          = true
      - allow_update_branch         = true -> null
      + archive_on_destroy          = true
        archived                    = false
        auto_init                   = false
        default_branch              = "main"
        delete_branch_on_merge      = true
      ~ description                 = "🚀 Essential files and guidance for all Ministry of Justice GitHub Repositories 🚀 Find us on Slack at #github-community" -> "Github \"template\" repository, from which to create new MoJ Repositories with organisation defaults • This repository is defined and managed in Terraform"
        etag                        = "W/\"8a4a64b37552e3c55b9b11b5f960df49f3d3c6807f0e1666099a39aba58c3698\""
        full_name                   = "ministryofjustice/template-repository"
        git_clone_url               = "git://github.com/ministryofjustice/template-repository.git"
        has_discussions             = false
        has_downloads               = true
        has_issues                  = true
        has_projects                = true
        has_wiki                    = false
      - homepage_url                = "https://github-community.service.justice.gov.uk/" -> null
        html_url                    = "https://github.com/ministryofjustice/template-repository"
        http_clone_url              = "https://github.com/ministryofjustice/template-repository.git"
        id                          = "template-repository"
        is_template                 = true
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "template-repository"
        node_id                     = "MDEwOlJlcG9zaXRvcnkyMjcwOTA2OTE="
        private                     = false
        repo_id                     = 227090691
      ~ squash_merge_commit_message = "BLANK" -> "COMMIT_MESSAGES"
      ~ squash_merge_commit_title   = "PR_TITLE" -> "COMMIT_OR_PR_TITLE"
        ssh_clone_url               = "git@github.com:ministryofjustice/template-repository.git"
        svn_url                     = "https://github.com/ministryofjustice/template-repository"
      ~ topics                      = [
          - "github-community",
          + "operations-engineering",
        ]
        visibility                  = "public"
        vulnerability_alerts        = true
        web_commit_signoff_required = false

        security_and_analysis {
            secret_scanning {
                status = "enabled"
            }
            secret_scanning_push_protection {
                status = "enabled"
            }
        }
    }

  # module.ministryofjustice.module.terraform-aws-mtasts.data.github_actions_public_key.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = "terraform-aws-mtasts"
    }

  # module.ministryofjustice.module.terraform-aws-mtasts.github_repository.default will be updated in-place
  # (imported from "terraform-aws-mtasts")
  ~ resource "github_repository" "default" {
        allow_auto_merge            = false
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
        allow_update_branch         = false
      + archive_on_destroy          = true
        archived                    = false
        auto_init                   = false
        default_branch              = "main"
        delete_branch_on_merge      = true
        description                 = "MTA-STS/TLS-RPT AWS Terraform Module • This repository is defined and managed in Terraform"
        etag                        = "W/\"15ea24282387d763d15b539ea3aad3a996df783bee282b13242a7d703fd2496b\""
        full_name                   = "ministryofjustice/terraform-aws-mtasts"
        git_clone_url               = "git://github.com/ministryofjustice/terraform-aws-mtasts.git"
        has_discussions             = false
        has_downloads               = true
        has_issues                  = true
        has_projects                = true
        has_wiki                    = false
        html_url                    = "https://github.com/ministryofjustice/terraform-aws-mtasts"
        http_clone_url              = "https://github.com/ministryofjustice/terraform-aws-mtasts.git"
        id                          = "terraform-aws-mtasts"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "terraform-aws-mtasts"
        node_id                     = "R_kgDOHWUugg"
        primary_language            = "HCL"
        private                     = false
        repo_id                     = 493170306
        squash_merge_commit_message = "COMMIT_MESSAGES"
        squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        ssh_clone_url               = "git@github.com:ministryofjustice/terraform-aws-mtasts.git"
        svn_url                     = "https://github.com/ministryofjustice/terraform-aws-mtasts"
        topics                      = [
            "operations-engineering",
        ]
        visibility                  = "public"
        vulnerability_alerts        = true
        web_commit_signoff_required = false

        security_and_analysis {
            secret_scanning {
                status = "enabled"
            }
            secret_scanning_push_protection {
                status = "enabled"
            }
        }
    }

  # module.ministryofjustice.module.terraform-aws-mtasts.github_team_repository.admin["4192115"] will be imported
    resource "github_team_repository" "admin" {
        etag       = "W/\"f0112c1e1d1e8c373a4d6e3e7858d9d7f0a14d6e569971a3b90f4edf1844d7c1\""
        id         = "4192115:terraform-aws-mtasts"
        permission = "admin"
        repository = "terraform-aws-mtasts"
        team_id    = "4192115"
    }

  # module.ministryofjustice.module.terraform-github-repository.data.github_actions_public_key.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = "terraform-github-repository"
    }

  # module.ministryofjustice.module.terraform-github-repository.github_repository.default will be updated in-place
  # (imported from "terraform-github-repository")
  ~ resource "github_repository" "default" {
        allow_auto_merge            = false
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
        allow_update_branch         = false
      + archive_on_destroy          = true
        archived                    = false
        auto_init                   = false
        default_branch              = "main"
        delete_branch_on_merge      = true
        description                 = "A Terraform module for GitHub repositories in the Ministry of Justice • This repository is defined and managed in Terraform"
        etag                        = "W/\"eb3389b595f270fccb0642b4ff45ca1ea193249f2d2ea5e2c46bcf8219e7eedc\""
        full_name                   = "ministryofjustice/terraform-github-repository"
        git_clone_url               = "git://github.com/ministryofjustice/terraform-github-repository.git"
        has_discussions             = true
        has_downloads               = true
        has_issues                  = true
        has_projects                = true
        has_wiki                    = false
        html_url                    = "https://github.com/ministryofjustice/terraform-github-repository"
        http_clone_url              = "https://github.com/ministryofjustice/terraform-github-repository.git"
        id                          = "terraform-github-repository"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "terraform-github-repository"
        node_id                     = "R_kgDOLELUgg"
        primary_language            = "HCL"
        private                     = false
        repo_id                     = 742577282
        squash_merge_commit_message = "COMMIT_MESSAGES"
        squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        ssh_clone_url               = "git@github.com:ministryofjustice/terraform-github-repository.git"
        svn_url                     = "https://github.com/ministryofjustice/terraform-github-repository"
        topics                      = [
            "github",
            "operations-engineering",
            "terraform",
            "terraform-module",
        ]
        visibility                  = "public"
        vulnerability_alerts        = true
        web_commit_signoff_required = false

        security_and_analysis {
            secret_scanning {
                status = "enabled"
            }
            secret_scanning_push_protection {
                status = "enabled"
            }
        }

        template {
            include_all_branches = false
            owner                = "ministryofjustice"
            repository           = "modernisation-platform-terraform-module-template"
        }
    }

  # module.ministryofjustice.module.terraform-github-repository.github_team_repository.admin["4192115"] will be imported
    resource "github_team_repository" "admin" {
        etag       = "W/\"8c4a531df631f20b392a01a844ee7ace67d20f67d98314016e98a4a877e84eb0\""
        id         = "4192115:terraform-github-repository"
        permission = "admin"
        repository = "terraform-github-repository"
        team_id    = "4192115"
    }

  # module.ministryofjustice-test.module.test-repo-levg.data.github_actions_public_key.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = "test-repo-levg"
    }

  # module.ministryofjustice-test.module.test-repo-levg.github_repository.default will be updated in-place
  # (imported from "test-repo-levg")
  ~ resource "github_repository" "default" {
        allow_auto_merge            = false
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
        allow_update_branch         = false
      + archive_on_destroy          = true
        archived                    = false
        auto_init                   = false
        default_branch              = "main"
        delete_branch_on_merge      = true
        description                 = "test repo • This repository is defined and managed in Terraform"
        etag                        = "W/\"016a906dea88944b05712f4d10298a67f151361516c586436a8598de6d081b11\""
        full_name                   = "ministryofjustice-test/test-repo-levg"
        git_clone_url               = "git://github.com/ministryofjustice-test/test-repo-levg.git"
        has_discussions             = false
        has_downloads               = true
        has_issues                  = true
        has_projects                = true
        has_wiki                    = true
        html_url                    = "https://github.com/ministryofjustice-test/test-repo-levg"
        http_clone_url              = "https://github.com/ministryofjustice-test/test-repo-levg.git"
        id                          = "test-repo-levg"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "test-repo-levg"
        node_id                     = "R_kgDOLPRAVQ"
        private                     = false
        repo_id                     = 754204757
        squash_merge_commit_message = "COMMIT_MESSAGES"
        squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        ssh_clone_url               = "git@github.com:ministryofjustice-test/test-repo-levg.git"
        svn_url                     = "https://github.com/ministryofjustice-test/test-repo-levg"
        topics                      = [
            "operations-engineering",
        ]
        visibility                  = "public"
        vulnerability_alerts        = true
        web_commit_signoff_required = false

        security_and_analysis {
            secret_scanning {
                status = "enabled"
            }
            secret_scanning_push_protection {
                status = "enabled"
            }
        }

        template {
            include_all_branches = false
            owner                = "ministryofjustice"
            repository           = "template-repository"
        }
    }

  # module.ministryofjustice-test.module.test_tamf_repo_test_org.data.github_actions_public_key.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = "test-tamf-repo-test-org"
    }

  # module.ministryofjustice-test.module.test_tamf_repo_test_org.github_repository.default will be updated in-place
  # (imported from "test-tamf-repo-test-org")
  ~ resource "github_repository" "default" {
        allow_auto_merge            = false
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
        allow_update_branch         = false
      + archive_on_destroy          = true
        archived                    = false
        auto_init                   = false
        default_branch              = "main"
        delete_branch_on_merge      = true
        description                 = "Test repo to test new module input team_access • This repository is defined and managed in Terraform"
        etag                        = "W/\"c0656491804ea598ae62b3aeccbb1f9dbe62785ddbda448d37444474edf50595\""
        full_name                   = "ministryofjustice-test/test-tamf-repo-test-org"
        git_clone_url               = "git://github.com/ministryofjustice-test/test-tamf-repo-test-org.git"
        has_discussions             = false
        has_downloads               = true
        has_issues                  = true
        has_projects                = true
        has_wiki                    = true
        html_url                    = "https://github.com/ministryofjustice-test/test-tamf-repo-test-org"
        http_clone_url              = "https://github.com/ministryofjustice-test/test-tamf-repo-test-org.git"
        id                          = "test-tamf-repo-test-org"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "test-tamf-repo-test-org"
        node_id                     = "R_kgDOLRPf2Q"
        primary_language            = "Python"
        private                     = false
        repo_id                     = 756277209
        squash_merge_commit_message = "COMMIT_MESSAGES"
        squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        ssh_clone_url               = "git@github.com:ministryofjustice-test/test-tamf-repo-test-org.git"
        svn_url                     = "https://github.com/ministryofjustice-test/test-tamf-repo-test-org"
        topics                      = [
            "operations-engineering",
        ]
        visibility                  = "public"
        vulnerability_alerts        = true
        web_commit_signoff_required = false

        security_and_analysis {
            secret_scanning {
                status = "enabled"
            }
            secret_scanning_push_protection {
                status = "enabled"
            }
        }

        template {
            include_all_branches = false
            owner                = "ministryofjustice"
            repository           = "template-repository"
        }
    }

  # module.ministryofjustice-test.module.test_tamf_repo_test_org.github_team_repository.maintain["9456244"] will be imported
    resource "github_team_repository" "maintain" {
        etag       = "W/\"7e9e17732f8212d0c881b6759a037b0c7c7b009588e076951838f268dc565a0c\""
        id         = "9456244:test-tamf-repo-test-org"
        permission = "maintain"
        repository = "test-tamf-repo-test-org"
        team_id    = "9456244"
    }

  # module.ministryofjustice-test.module.test_tamf_repo_test_org.github_team_repository.push["9472191"] will be imported
    resource "github_team_repository" "push" {
        etag       = "W/\"fdafbf69a27ce919780b568eedb40679d33ee557fe3081d27f8934fbcc328904\""
        id         = "9472191:test-tamf-repo-test-org"
        permission = "push"
        repository = "test-tamf-repo-test-org"
        team_id    = "9472191"
    }

Plan: 31 to import, 0 to add, 16 to change, 0 to destroy.

```